app/controllers/api/v1/cars_controller.rb

INSERT INTO "cars" ("name", "image", "model", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @car = Car.new(car_params)

    if @car.save

SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "cars" WHERE "cars"."id" = $1  [["id", 3]]
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 2]]
---
  def destroy
    @car = Car.find(params[:id])
    @car.reservations.destroy_all
    if @car.destroy