app/controllers/api/v1/reservations_controller.rb

  def index
    @reservations = Reservation.includes(:car).all
    @reservation_data = @reservations.map do |reservation|
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" IN ($1, $2, $3, $4)  [["id", 27], ["id", 36], ["id", 40], ["id", 38]]
SELECT "reservations".* FROM "reservations"

  def create
    reservation = Reservation.new(reservation_params.merge(user_id: current_user_id))

    if reservation.save
---
INSERT INTO "reservations" ("city", "start_date", "end_date", "user_id", "car_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"